{
  "destinations": [
    {
      "id": 1,
      "name": "Guadalupe Mountains National Park",
      "location":"Salt Flat, Texas",
      "description":"In the northwestern corner of the state, approximately 100 miles east of El Paso, Guadalupe Mountains National Park is home to the four highest peaks in Texas. It's also known for an abundance of wildlife, including golden eagles. The landscape itself is stunning, especially around the towering El Capitan, as well as the Guadalupe Peak, the highest elevation in Texas. It's also tremendously popular with hikers thanks to its more than 80 miles of trails through spectacular woodland canyons and lush springs. Be sure to stop in at the visitor center in Pine Springs for information on the park, including details of hiking and biking trails.",
      "image": "https://www.planetware.com/photos-large/USTX/us-texas-guadalupe-mountains-national-park.jpg",
      "likes": 8
    },
    {
      "id": 2,
      "name": "The Sixth Floor Museum, Dallas",
      "location":"Dallas, Texas",
      "description":"It was from the sixth floor of the Texas School Book Depository in Dallas that the fatal shot that took President John F. Kennedy's life was fired. Now home to The Sixth Floor Museum, this tall red-brick building offers a detailed account of the assassination, as well as Kennedy's legacy. Highlights include accounts of his presidential campaign and term as president, all supported by historic footage, photos, and artifacts. Also worth a visit while exploring downtown Dallas is the nearby John F. Kennedy Memorial, a huge monument dedicated to President Kennedy unveiled in 1970.",
      "image": "https://www.planetware.com/photos-large/USTX/us-texas-sixth-floor-museum.jpg"
    },
    {
      "id": 3,
      "name": "The Texas State Capitol in Austin",
      "location":"Austin,Texas",
      "description":"The Texas State Capitol, built in 1888, is considered one of the finest state legislatures in the US. In Austin's downtown core and now a National Historic Landmark, it certainly impresses with its dimensions, standing 308 feet tall. Highlights of its 22-acre park include monuments to the defenders of the Alamo and to veterans of the Vietnam War. Guided tours of the building's interior are available and start from the visitor center with its many displays. At dusk, head across to the Ann W. Richards Congress Avenue Bridge for a chance to witness the spectacle of a million or so Mexican free-tailed bats coming and going from their perches under the bridge.",
      "image": "https://www.planetware.com/photos-large/USTX/us-texas-capitol-austin.jpg"
      
    },
    {
      "id": 4,
      "name": "Padre Island National Seashore",
      "location":"Corpus Christi, Texas",
      "description":"The world's longest undeveloped barrier island, Padre Island is just a short drive south of Corpus Christi and stretches 70 miles from end-to-end. One of the most important conservation areas in Texas, Padre Island consists of more than 130,000 acres of beach, dunes, and grassland habitats, and is home to rare sea turtles and countless migratory birds, making it a birder's paradise. In fact, 350 different species visit this stopover on the Central Flyway migratory route. The Malaquite Visitor Center is the best place to begin your visit of this beautiful coastal region of the Gulf of Mexico. It provides plenty of information, as well as assistance for those with mobility issues, including specially adapted beach wheelchairs.",
      "image": "https://s.hdnux.com/photos/73/74/20/15713292/8/1200x0.jpg"
    },
    {
      "id": 5,
      "name": "Big Bend National Park",
      "location": "Chihuahuan Desert, Texas",
      "description":"In the Chihuahuan Desert of West Texas, on a huge bend in the Rio Grande River, lies some of the most dramatic and uniquely beautiful scenery in the state. Mountains, canyons, and the river flowing along the border, separating the United States from Mexico, offer a diverse range of recreational and sightseeing opportunities for visitors to Big Bend National Park. While most people simply enjoy touring along the roads, the park offers a full range of things to do. Outdoor enthusiasts will enjoy the extensive network of hiking trails and the beautiful campgrounds. Paddling along the Rio Grande or enjoying a picnic and wading into the water are other popular activities on warm days. With more than 400 species of birds, birdwatching is another prominent pastime in the park, but even if you are not looking for them, you are likely to see roadrunners darting across the roads or trails.",
      "image": "https://www.planetware.com/wpimages/2019/04/texas-attractions-big-bend-national-park-santa-elena-canyon-waders.jpg"
    },
    {
      "id": 6,
      "name": "Space Center Houston",
      "location": "Houston, Texas",
      "description": "Just 30 minutes' drive from the heart of Houston, Space Center Houston is one of the most popular tourist attractions in Texas. This is a wonderful place to learn about space exploration, upcoming missions, NASA's latest projects, and possibly even meet an astronaut. Space Center Houston is also home to Johnson Space Center and Mission Control, which can be visited on a tour. Plan to spend at least a half-day exploring the entire complex, which includes a space shuttle replica mounted on a shuttle carrier. Visitors can walk inside the shuttle and the carrier. You can also walk inside a replica of America's first space station, Skylab. Other highlights include seeing rockets and touching a rock from the moon and Mars. The center provides a fascinating insight into the operations of the world's largest space program, with countless exhibits, as well as films, models, astronaut-related artifacts, and displays on the experiments and developments at NASA.",
      "image": "https://www.planetware.com/wpimages/2019/03/texas-things-to-do-space-center-houston-astronauts-moon.jpg"
      
    },
    {
      "id": 7,
      "name": "The Alamo",
      "location":"San Antonio, Texas",
      "description":"The Alamo is one of the most important historic sites in America. Part of a mission station established in 1718, it was built by Franciscans in 1744 and by 1836, had been converted into a fort. It became famous during the Texas Revolution, when a small force, including Davie Crockett and James Bowie, barricaded themselves in against an overwhelmingly superior Mexican army some 3,000 strong. While the defeat saw all 187 defenders killed, the cry of 'Remember the Alamo!' rallied the state to eventually overcome the Mexicans. Today, you can visit this landmark to see its restored buildings and the cenotaph commemorating the fallen Texans. Inside is a museum with changing displays, featuring weapons and artifacts related to the events and the history of the mission. If you have time, it's worth visiting some of the other missions in the area, which are all part of the San Antonio Missions National Historic Park, and connected by the Mission Trail.",
      "image": "https://www.planetware.com/wpimages/2019/04/texas-san-antonio-mission-trail-alamo.jpg"
      
    },
    {
      "id": 8,
      "name": "an Antonio's River Walk",
      "location":"San Antonio, Texas",
      "description": "Stretching for several miles along the San Antonio River in the heart of the city, the River Walk is lined with restaurants and lovely outdoor patios, where you can sit and dine alongside the river. Built below street level, this pedestrian walkway hugs the river as it winds and weaves through the city, and is as popular among locals as it is for tourists, day and night. Although strolling along the river is the most popular thing to do here, another great way to enjoy the ambience of the area is on a leisurely cruise on a river boat. These run all the time and range from standard sightseeing trips to dinner cruises. ",
      "image": "https://www.planetware.com/photos-large/USTX/us-texas-san-antonio-river-walk.jpg"
      
    }
  ]
}
